Reports/УДАЛИТЬ_ОтчетПоВходящимКонтактам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>УДАЛИТЬ_ОтчетПоВходящимКонтактам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ВходящиеКонтакты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВходящиеКонтакты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатусыЛида</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВходящийКонтакт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_ВходящийКонтакт</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/УДАЛИТЬ_ОтчетПоВходящимКонтактам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция СформироватьНаСервереВидыКонтактов()
	
	Возврат МодульОтчетов.СформироватьОтчетПоВходящимКонтактамВРазрезеВидовКонтактов(Отчет.ДатаНачала, Отчет.ДатаОкончания);		
	
КонецФункции

&НаСервере
Функция СформироватьНаСервереМенеджеры()
	
	Возврат МодульОтчетов.СформироватьОтчетПоВходящимКонтактамВРазрезеМенеджеров(Отчет.ДатаНачала, Отчет.ДатаОкончания);
	
КонецФункции

&НаСервере
Функция СформироватьНаСервереРекламныеИсточники()
	
	Возврат МодульОтчетов.СформироватьОтчетПоВходящимКонтактамВРазрезеРекламныхИсточников(Отчет.ДатаНачала, Отчет.ДатаОкончания);
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Если ВидОтчета = "" Тогда 
		ПоказатьПредупреждение(, "Не выбран Вид отчета");
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Анализ, "НеИспользовать");

	Если ВидОтчета = "ВидыКонтактов" Тогда 
		Анализ = СформироватьНаСервереВидыКонтактов();
	ИначеЕсли ВидОтчета = "Менеджеры" Тогда 
		Анализ = СформироватьНаСервереМенеджеры();
	ИначеЕсли ВидОтчета = "РекламныеИсточники" Тогда 
		Анализ = СформироватьНаСервереРекламныеИсточники();		
	КонецЕсли;
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Если Отчет.ДатаНачала = Дата("00010101") Тогда
		Отчет.ДатаНачала = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	Если Отчет.ДатаОкончания = Дата("00010101") Тогда
		Отчет.ДатаОкончания = КонецМесяца(ТекущаяДата());
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Анализ, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	// 2017-07-12 обработка расшифровки 
	СтандартнаяОбработка = Ложь;	
	ПараметрыФормы = Новый Структура("ДатаНачала, ДатаОкончания", Отчет.ДатаНачала, Отчет.ДатаОкончания);
	
	Если Расшифровка.Свойство("ВидКонтакта") Тогда
		ПараметрыФормы.Вставить("ВидКонтакта", Расшифровка.ВидКонтакта);
	КонецЕсли;
	
	Если Расшифровка.Свойство("ИспользоватьВидКонтакта") Тогда
		ПараметрыФормы.Вставить("ИспользоватьВидКонтакта", Истина);
	КонецЕсли;
	
	Если Расшифровка.Свойство("СтолбецЗамеры") Тогда
		ПараметрыФормы.Вставить("СтолбецЗамеры", Истина);
	КонецЕсли;
	Если Расшифровка.Свойство("Сотрудник") Тогда
		ПараметрыФормы.Вставить("Сотрудник", Расшифровка.Сотрудник);
	КонецЕсли;
	
	Если Расшифровка.Свойство("РекламныйИсточник") Тогда
		ПараметрыФормы.Вставить("РекламныйИсточник", Расшифровка.РекламныйИсточник);
		ПараметрыФормы.Вставить("ОтборРекламныйИсточник", Истина);
	КонецЕсли;
		
	Форма = ПолучитьФорму("РегистрСведений.ВходящиеКонтакты.Форма.ФормаСпискаРасшифровка", ПараметрыФормы); 
	Форма.Открыть();	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтчетовПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Анализ, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Анализ, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Анализ, "НеАктуальность");
КонецПроцедуры
